#!/usr/bin/env ruby
#1000以下なら総当りでいいよね
=begin
T=[
	[[0,-1,2,1],[-1,0,4,0],[0,0,1,3],[0,0,5,2],[0,-1,3,4]],
	[[-1,0,3,1],[-1,1,5,0],[0,0,2,3],[0,0,0,2],[-1,0,4,4]],
	[[-1,1,4,1],[0,1,0,0],[0,0,3,3],[0,0,1,2],[-1,1,5,4]],
	[[0,1,5,1],[1,0,1,0],[0,0,4,3],[0,0,2,2],[0,1,0,4]],
	[[1,0,0,1],[1,-1,2,0],[0,0,5,3],[0,0,3,2],[1,0,1,4]],
	[[1,-1,1,1],[0,-1,3,0],[0,0,0,3],[0,0,4,2],[1,-1,2,4]],
]
=end
D=[[0,-1],[-1,0],[-1,1],[0,1],[1,0],[1,-1]]
T=6.times.map{|i|
	[[*D[i],(i+2)%6,1],[*D[(i+1)%6],(i+4)%6,0],[0,0,(i+1)%6,3],[0,0,(i+5)%6,2],[*D[i],(i+3)%6,4]]
}
cur=[0,0,0,1] # this 1 is dummy
mapping={}
trail=Hash.new{|h,k|h[k]=[]}
trail[mapping[cur[0,3]]]=[]
mapping[cur[0,3]]=1
2.upto(1500){|i|
	x,y,z,d=cur
	(-1).downto(-4){|j|
		#go clockwise
		dx,dy,dz,dd=T[z][(d+j)%5]
		nxt=[x+dx,y+dy,dz,dd]
		f=mapping.has_key?(nxt[0,3])
		mapping[nxt[0,3]]=i if !f
		trail[mapping[nxt[0,3]]]<<mapping[cur[0,3]]
		trail[mapping[cur[0,3]]]<<mapping[nxt[0,3]]
		(cur=nxt;break) if !f
	}
}
puts trail[gets.to_i].sort*','
