#!/usr/bin/ruby
#http://riverplus.net/ciq39

def isok(n)
	s=n.to_s
	l=s.size
	l%2==0 && s[0,l/2]==s[l/2..-1]
end

require 'prime'
n=(1..1/0.0).find{|n|a=(10**n+1).prime_division;a.any?{|x,y|y>1}}
r=1
(10**n+1).prime_division.each{|n,p|r*=n**(p/2*2)}
m=(10**n+1)**2/r
s=(1..1/0.0).find{|s|isok(m*s**2)}
p m*s**2

__END__
(10**n+1)*x==y**2なるx,yを求めることが第一段階である。
このとき、xは(10**n+1)よりも小さくないといけないから、(10**n+1)は平方数を因数に持つ必要がある。
これを満たす最小のnは11である。
(10**11+1)は11**2を因数に持つ(rとする)。
x=(10**n+1)/121であるから、y**2は((10**n+1)/11)**2と書ける(mとする)。
ただし、82644628100826446281はコピペ数の条件を満たさないから、適当な平方数を掛けて、条件をみたすようにすれば良い。
条件を満たす平方数は16である(s=4)。
以上より、答えは1322314049613223140496である。
(10**11+1をNとすると、N*(N/121*16)==36363636364**2)