#!/usr/bin/ruby
#coding:utf-8
def matthew(love)
	love%15==0 ? '抱いて！' :
	love%3==0 ? 'マシュー' :
	love%5==0 ? '大好き' :
	love
end
puts (1..100).map(&method(:matthew))*','

#いつものことながら変数名を考える方がつらいみゅ。
__END__
1,2,マシュー,4,大好き,マシュー,7,8,マシュー,大好き,11,マシュー,13,14,抱いて！,16,17,マシュー,19,大好き,マシュー,22,23,マシュー,大好き,26,マシュー,28,29,抱いて！,31,32,マシュー,34,大好き,マシュー,37,38,マシュー,大好き,41,マシュー,43,44,抱いて！,46,47,マシュー,49,大好き,マシュー,52,53,マシュー,大好き,56,マシュー,58,59,抱いて！,61,62,マシュー,64,大好き,マシュー,67,68,マシュー,大好き,71,マシュー,73,74,抱いて！,76,77,マシュー,79,大好き,マシュー,82,83,マシュー,大好き,86,マシュー,88,89,抱いて！,91,92,マシュー,94,大好き,マシュー,97,98,マシュー,大好き