#!/usr/bin/Rscript
csv <- read.csv('sales.csv')
for(i in 1:10){
	t <- csv[csv[,'product_id']==i,'t']
	sales <- csv[csv[,'product_id']==i,'sales']
	model <- lm(sales ~ t+I(t^2)+I(t^3)+I(t^4))
	coef <- as.numeric(model$coefficients)
	cat(paste('データ',i,"\n",sep=''))
	cat(paste('決定係数:',summary(model)$r.squared,"\n",sep=''))
	cat('回帰式:')
	t_pred=200
	sales_pred=0
	for(j in rev(0:4)){
		cat(coef[j+1])
		if(j>0)cat('t')
		if(j>1)cat(paste('^',j,sep=''))
		if(j>0)cat('+')
		sales_pred <- sales_pred + coef[j+1] * t_pred^j
	}
	cat("\n")
	cat(paste('予測値:',sales_pred,"\n",sep=''))
}
quit()

決定係数が良さそうだったので4次式にしました。

しかし、多項式回帰ではだめだったようです。すみません。
時間があったら解き直します。

データ1
決定係数:0.894135727774796
回帰式:-0.0559409t^4+13.95642t^3+-1228.662t^2+42159.19t+-200216.3
予測値:-18768930.6386907
データ2
決定係数:0.969100666868934
回帰式:-0.02357903t^4+6.317476t^3+-647.1106t^2+31320.99t+-326875
予測値:-7133746.35283341
データ3
決定係数:0.977647254533202
回帰式:-0.01013452t^4+3.168177t^3+-403.4885t^2+26098.73t+-568286
予測値:-2357890.23394468
データ4
決定係数:0.890307907189855
回帰式:-0.08904174t^4+23.93441t^3+-2309.189t^2+91422.39t+-937371.6
予測値:-26011959.4989167
データ5
決定係数:0.906504815550056
回帰式:-0.02308272t^4+7.031357t^3+-828.5401t^2+42156.21t+-279767.4
予測値:-5671615.43362744
データ6
決定係数:0.917738492159768
回帰式:-0.002840883t^4+0.846717t^3+-101.7387t^2+6711.305t+-44825.42
予測値:-543790.068766328
データ7
決定係数:0.968592017637828
回帰式:-0.1415822t^4+36.55322t^3+-3314.771t^2+117439.1t+-976516.9
予測値:-44185305.2704881
データ8
決定係数:0.900026717011907
回帰式:-0.025677t^4+7.427038t^3+-809.4882t^2+39440.19t+-606178.2
予測値:-6764559.87215588
データ9
決定係数:0.912419503743365
回帰式:-0.3126502t^4+96.51209t^3+-11088.23t^2+558130t+-9878009
予測値:-69924607.1397882
データ10
決定係数:0.980931617399347
回帰式:-0.003796234t^4+1.064765t^3+-114.3311t^2+5465.55t+-269.0055
予測値:-1036260.88093748